In [1]:
import pandas as pd

In [3]:
emt_df = pd.DataFrame()
print(emt_df)

Empty DataFrame
Columns: []
Index: []

In [4]:
ls = ["a", "b", "c"]
ls

['a', 'b', 'c']

In [5]:
df1 = pd.DataFrame(ls)
df1

   0
0  a
1  b
2  c

In [6]:
ls_of_ls = [[1,2,3], [4,5,6], [7,8,9]]
ls_of_ls

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [7]:
df2 = pd.DataFrame(ls_of_ls)
df2

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [8]:
dict1 = {"1d": [11,22,33,44]}
dict1

{'1d': [11, 22, 33, 44]}

In [9]:
df3 = pd.DataFrame(dict1)
df3

   1d
0  11
1  22
2  33
3  44

In [14]:
dict2 = {"1d": [11,22,33,44], "2d": [11,22,33,44]}
dict2

{'1d': [11, 22, 33, 44], '2d': [11, 22, 33, 44]}

In [15]:
df4 = pd.DataFrame(dict2)
df4

   1d  2d
0  11  11
1  22  22
2  33  33
3  44  44

In [18]:
ls_dict = [{"a": 1, "b": 2}, {"a": 3, "b": 4}]
dfs = pd.DataFrame(ls_dict)
dfs

   a  b
0  1  2
1  3  4

In [19]:
ls_dict = [{"a": 1, "b": 2}, {"a": 3, "b": 4, "c": 5}]
dfs = pd.DataFrame(ls_dict)
dfs

   a  b    c
0  1  2  NaN
1  3  4  5.0

In [20]:
dict_sr = {"id": pd.Series([1,2,3]), "sn": pd.Series([111,222,333])}
df6 = pd.DataFrame(dict_sr)
df6

   id   sn
0   1  111
1   2  222
2   3  333